app/controllers/auctions_controller.rb

SELECT * FROM "auctions"
---
  def index
    @auctions = Auction.all

SELECT * FROM "auctions" WHERE ("auctions"."id" = 1)
---
  def show
    @auction = Auction.find(params[:id])

INSERT INTO "auctions" ("name", "created_at", "updated_at", "exchange_rate") VALUES('auction test 1', '2010-04-21 13:07:24', '2010-04-21 13:07:24', 1.5)
---
  def create
    @auction = Auction.new(params[:auction])

    respond_to do |format|
      if @auction.save